app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 75], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "j"], ["description", "j"], ["updated_at", "2021-02-09 12:45:46.948977"], ["id", 75]]
---
  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)